Semester-7/Технология разработки прикладных решений 1С/lab10/src/Documents/ПродажаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПродажаТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab10/src/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab10/src/Documents/ПродажаТоваров/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// Списание партиями по возрастанию срока годности (FEFO).
	Движения.ОстаткиТоваров.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаСостав.Товар КАК Товар,
		|	СУММА(ПродажаСостав.Количество) КАК Количество
		|ПОМЕСТИТЬ ДОК
		|ИЗ
		|	Документ.ПродажаТоваров.Состав КАК ПродажаСостав
		|ГДЕ
		|	ПродажаСостав.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПродажаСостав.Товар
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.Товар КАК Товар,
		|	Остатки.СрокГодности КАК СрокГодности,
		|	Остатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ОСТ
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(, Товар В (ВЫБРАТЬ ДОК.Товар ИЗ ДОК КАК ДОК)) КАК Остатки
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДОК.Товар КАК Товар,
		|	ДОК.Количество КАК Требуется,
		|	ОСТ.СрокГодности КАК СрокГодности,
		|	ЕСТЬNULL(ОСТ.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	ДОК КАК ДОК
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОСТ КАК ОСТ
		|		ПО ДОК.Товар = ОСТ.Товар
		|УПОРЯДОЧИТЬ ПО
		|	Товар,
		|	СрокГодности
		|ИТОГИ
		|	МАКСИМУМ(Требуется)
		|ПО
		|	Товар";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	ВыборкаТовары = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Товар");

	Пока ВыборкаТовары.Следующий() Цикл

		ОсталосьСписать = ВыборкаТовары.Требуется;
		ВыборкаПартии = ВыборкаТовары.Выбрать();

		Пока ВыборкаПартии.Следующий() Цикл

			Если ОсталосьСписать <= 0 Тогда
				Прервать;
			КонецЕсли;
			Если ВыборкаПартии.Остаток <= 0 Тогда
				Продолжить;
			КонецЕсли;

			СписатьИзПартии = Мин(ОсталосьСписать, ВыборкаПартии.Остаток);

			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = ВыборкаТовары.Товар;
			Движение.СрокГодности = ВыборкаПартии.СрокГодности;
			Движение.Количество = СписатьИзПартии;

			ОсталосьСписать = ОсталосьСписать - СписатьИзПартии;

		КонецЦикла;

		Если ОсталосьСписать > 0 Тогда
			Отказ = Истина;
			Сообщить("Не хватает товара " + ВыборкаТовары.Товар
				+ ": не хватает " + Формат(ОсталосьСписать, "ЧГ=0"));
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
